app/Controllers/NoteController.php

SELECT *
FROM `activities`
WHERE `created_by` = '1'
---
    public function create()
    {
        $activities = $this->activitiesModel->where('created_by', session()->get('user_id'))->findAll();

SELECT *
FROM `notes`
WHERE `notes`.`id` = '1'
SELECT *
FROM `activities`
WHERE `created_by` = '1'
---
    public function edit($id)
    {
        $task = $this->notesModel->find($id);
        $activities = $this->activitiesModel->where('created_by', session()->get('user_id'))->findAll();