app/Controllers/NotificationController.php

SELECT *
FROM `user_devices`
WHERE `user_id` = '1'
AND `token` = 'cCcj7Rub6DuYg6Rwyz9LMb:APA91bEv-yHdb5tlJ87bS_Zx2oVRyMLPx_f4bZrwJp_qCZRTD_3cqirfBFZAMhvmTwyVSK6bYq_p4Z62Belw4Kf6u65pqUGTWwOEnrpz7NVCt5abJxI0XF8'
 LIMIT 1
---
    public function saveToken()
    {
        $request = $this->request;
        /** @var \CodeIgniter\HTTP\IncomingRequest $request */
        $data = $request->getJSON(true);
        $userId = session('user_id');
        if (!$userId) {
            return $this->failUnauthorized('You must login first');
        }

        if (!isset($data['token'])) {
            return $this->fail('Token required');
        }

        $deviceType = $request->getUserAgent()->isMobile() ? 'android' : 'web';

        $model = new UserDeviceModel();

        // Cek apakah token sudah ada
        $existing = $model->where('user_id', $userId)
                        ->where('token', $data['token'])
                        ->first();