app/Controllers/TaskController.php

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '1'
SELECT *
FROM `activities`
WHERE `activities`.`id` = '1'
---
    public function getSubtask($id)
    {
        $task = $this->taskModel->find($id);
        if (!$task) {
            return $this->response->setStatusCode(404)
                ->setJSON(['error' => 'Subtask not found']);
        }
        // validasi agar user tidak bisa akses milik orang lain
        $activity = $this->activityModel->find($task['activity_id']);