app/Models/ActivitiesModel.php

    public function getAllWithRelations()
    {
    return $this->select('
            activities.*,
            users.name AS creator_name,
            next_schedule.next_run_at AS next_run_at
        ')
        ->join('users', 'users.id = activities.created_by', 'left')
        // Join to a subquery that finds the MINIMUM next_run_at (closest to now) for each activity_id
        ->join('(
            SELECT
                activity_id,
                MIN(next_run_at) AS next_run_at
            FROM
                activity_schedule
            WHERE
                next_run_at >= NOW() -- Only consider schedules in the future or present
            GROUP BY
                activity_id
        ) AS next_schedule', 'next_schedule.activity_id = activities.id')
        ->orderBy('activities.id', 'ASC')
        ->findAll();
---
SELECT `activities`.*, `users`.`name` AS `creator_name`, `next_schedule`.`next_run_at` AS `next_run_at`
FROM `activities`
LEFT JOIN `users` ON `users`.`id` = `activities`.`created_by`
JOIN (
            SELECT 
                activity_id, 
                MIN(next_run_at) AS next_run_at
            FROM 
                activity_schedule
            WHERE 
                next_run_at >= NOW() -- Only consider schedules in the future or present
            GROUP BY 
                activity_id
        ) AS next_schedule ON `next_schedule`.`activity_id` = `activities`.`id`
ORDER BY `activities`.`id` ASC