app/Models/NotesModel.php

    public function getUserNotes($userId)
    {
        return $this->where('user_id', $userId)->findAll();
---
SELECT *
FROM `notes`
WHERE `user_id` = '1'