app/Models/TasksModel.php

SELECT *
FROM `tasks`
WHERE `activity_id` = '1'
---
    public function getTasksByActivity($activityId)
    {
        return $this->where('activity_id', $activityId)->findAll();